import React, { useState, useEffect, useRef } from 'react';
import styles from './SeventhScreen.module.css'
import WorkSteps from '../components/worksStep/Steps';
import Button from '../components/buttonForm/Button';
import FAQItem from '../components/questions/Questions';

const SevevnthScreen = () => {
return <>

  <div className={styles.title}>
שאלות נפוצות
      </div>
        <div className={styles.description}>
ריכזתי עבורכם שאלות שקיבלתי בעבר שאני בטוחה שעלו לחלקכם לראש במהלך הדרך.. לחצו על כל שאלה והתשובה תיפתח
      </div>
     
 <FAQItem
  question="איך את יודעת מה נכון לבית שלנו?"
  answer="ברגע שאני מבינה את הצרכים, ההרגלים, והאופי של מי שגר בבית - הרבה דברים מתבהרים. המטרה היא לא רק לייצר משהו יפה (וזה יהיה יפה בוודאות), אלא משהו שיתאים בדיוק לאיך שאתם חיים. אני שואלת, בודקת, ומתכננת את הבית סביבכם וסביב הרגלי המחייה שלכם - לא סביב טרנדים או סטנדרטים כלליים."
/>



      <FAQItem
        question="אם יש לי ספקים משלי, את עובדת איתם?"
        answer="ברור. אתם בוחרים עם מי לעבוד. אני לא מחייבת ספקים שלי. אני בודקת שהעבודה מולם זורמת ומדויקת. המטרה היא שהתהליך יצליח - לא משנה מי בשטח. אני שם כדי לוודא שזה קורה."
      />

      <FAQItem
        question="מה את עושה כשיש חילוקי דעות בין בני הזוג?"
        answer="בדיוק בשביל זה יש תיאום ציפיות בתחילת הדרך. אני לא מתחילה שום תהליך בלי ששניכם יודעים מה עומד לקרות. כל החלטה מתקבלת בהסכמה. אני עוזרת לגשר, להבהיר, ולוודא ששניכם שותפים אמיתיים לבחירות."
      />


      <FAQItem
        question="מה קורה אם נרצה לשנות משהו ברגע האחרון?"
        answer="אני תמיד בודקת מראש את כל הפרטים כדי לא להגיע לשינויים מאוחרים, אבל אם יש שינוי - אני שם כדי להוביל אותו נכון. בלי פאניקה, בלי בזבוז. עם ניסיון, סדר ובקרה."

      />
  <FAQItem
  question="כמה זמן מראש כדאי לפנות אלייך?"
  answer="כמה שיותר מוקדם - יותר טוב. אם יש לכם תוכנית שיפוץ, רכשתם דירה, או אתם שוקלים שינוי משמעותי בבית, תדברו איתי כבר בשלב הרעיון. ככה נמנע טעויות קריטיות בתכנון ונוכל לבנות תהליך מסודר בזמן שנוח לכם, בלי לחץ."
/>


      <Button text="אורלי, יש לי עוד שאלות"/>

</>
};

export default SevevnthScreen;