import React, { useState, useEffect, useRef } from 'react';
import styles from './SeventhScreen.module.css';
import WorkSteps from '../components/worksStep/Steps';
import Button from '../components/buttonForm/Button';
import FAQItem from '../components/questions/Questions';

const SevevnthScreen = () => {
  return (
    <>
      <div className={styles.title}>שאלות נפוצות</div>
      <div className={styles.description}>
        ריכזתי עבורכם שאלות שקיבלתי בעבר שאני בטוחה שעלו לחלקכם לראש במהלך הדרך.. לחצו על כל שאלה והתשובה תיפתח
      </div>

      <FAQItem
        question="למה לי לקחת אדריכל שהוא גם מעצב פנים?"
        answer="כשאת בוחרת באדריכל שהוא גם מעצב פנים – את מרוויחה תכנון שלם, מדויק והרמוני – מהשלד ועד לכרית בסלון. היתרון הוא בחשיבה אינטגרטיבית: לא רק שהמבנה מתוכנן נכון פונקציונלית, אלא שהעיצוב הפנימי מתמזג איתו כבר מהשלב הראשוני. התוצאה? ניצול מקסימלי של השטח, התאמה אישית לצרכים שלך, וחוויה עיצובית הוליסטית, שבה כל פרט מחובר לתמונה הגדולה."
      />

      <FAQItem
        question="מתי הזמן האידיאלי להתחיל תכנון שינויי דיירים?"
        answer="מיד לאחר חתימת חוזה הרכישה של הדירה. תכנון מוקדם וחשיבה על שינויי תשתית (כמו הזזת קירות או תכנון חשמל מחדש) בשלבים אלו יאפשרו ביצועם בעלות נמוכה יותר, וימנעו עיכובים ועלויות נוספות הכרוכות בשינויים לאחר שהדירה כבר בנויה."
      />

      <FAQItem
        question="באיזה שלב בפרויקט כדאי לקחת מעצב פנים?"
        answer="מומלץ לקחת כבר בשלבי החיפוש וההתלבטויות. לרבים מלקוחותיי סייעתי וייעצתי לגבי הפוטנציאל של הנכס, התאמתו למשפחה ולתקציב הריאלי לבנייה או שיפוץ."
      />

      <FAQItem
        question="האם שירות כזה יתאים לתקציב שלי?"
        answer="כן. אחד מתפקידי כמעצבת הוא לעזור לכם לתכנן נכון גם במסגרת תקציבית מוגדרת. תכנון מדויק מראש חוסך טעויות יקרות ותוספות לא מתוכננות בהמשך, ולכן הוא לא הוצאה – אלא השקעה נבונה."
      />

      <FAQItem
        question="מה בכלל כולל השירות?"
        answer="השירות כולל שלבים ברורים: פגישת היכרות והבנת הצרכים, פיתוח קונספט עיצובי, תכנון מפורט ותוכניות עבודה, ליווי בבחירת חומרים וריהוט, פיקוח בשטח עד למסירת הפרויקט. כל פרויקט מותאם אישית – כך שתקבלו בדיוק את מה שאתם צריכים."
      />

      <FAQItem
        question="וכמה זמן זה ייקח?"
        answer="משך התהליך תלוי בהיקף הפרויקט – שיפוץ, בנייה או סטיילינג בלבד. עם זאת, כבר מהפגישה הראשונה תדעו מה לוחות הזמנים המשוערים, ותהיו מעודכנים לאורך כל הדרך. העבודה מתנהלת בצורה מסודרת ומקצועית, כדי לעמוד בזמנים מבלי להתפשר על איכות."
      />

      <FAQItem
        question="האם את עובדת רק עם הספקים שלך?"
        answer="אני עובד עם ספקים שאני מכיר - כאלה שראיתי איך הם עובדים ושטווח המחירים שלהם הכי משתלם עבורכם. זה נותן לי ביטחון ולכם חוסך הפתעות. אבל אם יש לכם ספק שאתם רוצים לעבוד איתו - כמובן שנשב, נבחן ונראה אם זה מתאים. הכי חשוב לי שתרגישו טוב עם מי שמלווה אתכם בדרך."
      />

      <FAQItem
        question="האם השירות כולל הדמיות?"
        answer="בהחלט כן. השירות כולל הדמיות תלת־ממד שממחישות בדיוק איך ייראה החלל אחרי העיצוב. זה עוזר לכם להבין את התוצאה עוד לפני הביצוע, לראות חומרים, צבעים ופרטים — ולעשות החלטות בטוחות בלי הפתעות בהמשך."
      />

      <FAQItem
        question="האם אפשר לשנות תכנון במהלך הביצוע?"
        answer="אפשרי אבל לא מומלץ. שינויים במהלך ביצוע יקרים יותר ועלולים לגרום לעיכובים משמעותיים."
      />

      <FAQItem
        question="למה חשוב לקחת מעצבת פנים לתכנון ועיצוב עסק?"
        answer="תכנון ועיצוב עסק הוא לא רק עניין של אסתטיקה – הוא כלי אסטרטגי לשיפור חוויית הלקוח, בידול מהמתחרים והגדלת המכירות. עיצוב נכון משפיע על איך הלקוחות מרגישים בחלל, כמה זמן הם נשארים, ואפילו כמה הם קונים. בנוסף, הוא יוצר סביבת עבודה נעימה ויעילה גם עבור העובדים."
      />

      <FAQItem
        question="מה אם נרצה להפסיק את התהליך לפני סיומו?"
        answer="אם במהלך הדרך תרגישו שאתם רוצים להפסיק את התהליך – מכל סיבה שהיא – כמובן שתוכלו לעשות זאת. במקרה כזה, תבוצע התחשבנות לפי שלבי העבודה שכבר בוצעו בפועל, בהתאם להסכם שנחתם בתחילת הפרויקט. כל שלב מתומחר בנפרד, כך שתמיד תדעו על מה שילמתם ומה קיבלתם."
      />

      <FAQItem
        question="למה לבחור בך?"
        answer="מהפגישה הראשונה שבה תשתפו אותנו בחלומות שלכם ועד הרבה אחרי מסירת המפתח. אני לא רק מתמחה בבנייה למשפחות אלא שהלקוחות שלי הם כמו משפחה מבחינתי. הניסיון שלי הוא היתרון שלכם. מי שראה (כמעט) הכל, יודע גם לספק לכם מענה בדיוק למה שאתם צריכים. כל אחד מהבתים שתכננתי הוא חלק ממני. אתם תקצרו את המחמאות ואני אשמח שהייתה לי ההזדמנות להיות חלק מזה."
      />

      <Button text="אורלי, יש לי עוד שאלות" />
    </>
  );
};

export default SevevnthScreen;
